In [3]:
import pandas as pd
from sqlalchemy import create_engine

In [28]:
Texas_locational_file = "../ETL-Project/CSV's/area_context_texas.csv"
Texas_locational_df = pd.read_csv(Texas_locational_file)
Texas_locational_df.head()

,Housing Units,zipcode,Water Area,Median Home Value,Median Household Income,Population Density,Occupied Housing Units,Population,id,Land Area
0,8102,75001,0.00,258200,57633,3237,7088,12414,750,3.83
1,21373,75002,2.06,186100,91632,1699,20708,63140,750,37.16
2,17747,75006,0.25,146800,56985,2746,16631,46364,750,16.89
3,19296,75007,0.22,169400,78934,4433,18514,51624,750,11.65
4,3074,75009,1.57,190500,87581,92,2812,8785,750,95.42

In [33]:
# Create a filtered dataframe from specific columns
Texas_locational_cols=["zipcode", "Median Household Income", "Population", "id"]
Texas_locational_refined= Texas_locational_df[Texas_locational_cols].copy()

# Rename the column headers
Texas_locational_refined = Texas_locational_refined.rename(columns={"zipcode": "Zipcode",
                                                          "Median Household Income": "Median Income",
                                                          "Population": "population",
                                                          "id": "ID"})

# Clean the data by dropping duplicates and setting the index
Texas_locational_refined.drop_duplicates("Zipcode", inplace=True)
Texas_locational_refined.set_index("Zipcode", inplace=True)

Texas_locational_refined.head()

         Median Income  population   ID
Zipcode
75001            57633       12414  750
75002            91632       63140  750
75006            56985       46364  750
75007            78934       51624  750
75009            87581        8785  750

In [4]:
rds_connection_string = "jon:postgres@localhost:5432/Texas_locational_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [7]:
table_names = engine.table_names()
table_names

['texas_regional_info']

In [36]:
Texas_locational_refined.to_sql(name='Texas_regional_info', con=engine, if_exists='append', index=True)

In [8]:
pd.read_sql_query(f'select * from {table_names[0]}', con=engine).head()

    ID  Zipcode  Median Income  population
0  750    75001          57633       12414
1  751    75101          33438         646
2  752    75201          67979        9409
3  753    75390              0           0
4  754    75401          31274       18552